#### Terraform Initialization ⚙️ `success`

#### Terraform Validation ✅ `success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```

Acquiring state lock. This may take a few moments...
cloudflare_record.public: Refreshing state... [id=7c61aec58476a23b29a5c8438303cdfb]
data.cloudflare_zone.zone_internal: Reading...
data.cloudflare_zone.zone_external: Reading...
data.cloudflare_zone.zone_internal: Read complete after 0s [id=9280cbd559c3a2a8eab76178aa91fa27]
cloudflare_record.dkim: Refreshing state... [id=b655c47c4678e736f1dcab39d93d0e7e]
cloudflare_record.vpn: Refreshing state... [id=b6fc722ed7bb4fceebc3e7989dd74435]
cloudflare_record.google: Refreshing state... [id=d4e916fcbb81e0ff639e18adb07dca15]
cloudflare_record.spf: Refreshing state... [id=702428310fb0366086edf0dfb70a8a6d]
cloudflare_record.dmarc: Refreshing state... [id=f822111bf1aceaa36010d546f62c6227]
data.cloudflare_zone.zone_external: Read complete after 1s [id=2cfd579b89369f6a8e7f2d6f55c1dfca]
cloudflare_record.docs: Refreshing state... [id=a40e8470f6e7bd145dc0ae7d7bc823ae]
cloudflare_record.charts: Refreshing state... [id=89c50ff8669abcc19476c8300b3aaab5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.public will be destroyed
  # (because cloudflare_record.public is not in configuration)
  - resource "cloudflare_record" "public" {
      - allow_overwrite = false -> null
      - created_on      = "2022-10-29T10:34:26.286955Z" -> null
      - hostname        = "*.pascaliske.dev" -> null
      - id              = "7c61aec58476a23b29a5c8438303cdfb" -> null
      - metadata        = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> null
      - modified_on     = "2023-02-08T10:17:46.50376Z" -> null
      - name            = "*" -> null
      - proxiable       = true -> null
      - proxied         = false -> null
      - tags            = [] -> null
      - ttl             = 1 -> null
      - type            = "A" -> null
      - value           = "89.58.45.252" -> null
      - zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca" -> null
    }

  # cloudflare_record.wildcard will be created
  + resource "cloudflare_record" "wildcard" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "*"
      + proxiable       = (known after apply)
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "89.58.45.252"
      + zone_id         = "2cfd579b89369f6a8e7f2d6f55c1dfca"
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pushed by: @pascaliske, Action: `pull_request`, Workflow: `Terraform`*